RhinoInside.Revit API Documentation
GeometryDecoder.ToBoundingBox Method (Outline)
 Converts the specified Outline to an equivalent Rhino BoundingBox.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Rhino.Geometry.BoundingBox ToBoundingBox(
	this Autodesk.Revit.DB.Outline value
)
Parameters
value
Type: Autodesk.Revit.DB.Outline
A value to convert.
Return Value
Type: Rhino.Geometry.BoundingBox
A Rhino BoundingBox that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Outline. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
ToBoundingBox Overload
RhinoInside.Revit.Convert.Geometry Namespace